# Тест

In [ ]:
table_employees (Таблица сотрудников)

salary    bonus
2000      null
null      500
4500      1000
null      null
2000      300
3000      700

Дана таблица с информацией о зарплатах сотрудников. В таблице хранится оклад (salary) и премия (bonus).
Необходимо определить результат следующих запросов:

In [ ]:

SELECT min(salary) FROM table_employees = 2000

SELECT max(salary) FROM table_employees = 

SELECT sum(salary) FROM table_employees = 
 
SELECT sum(1000) FROM table_employees = 

SELECT count(*) FROM table_employees = 

SELECT count(1) FROM table_employees = 

SELECT count('salary') FROM table_employees = 

SELECT count(salary) FROM table_employees = 

SELECT count(distinct salary) FROM table_employees = 

SELECT sum(COALESCE(salary, 0)) FROM table_employees = 

SELECT sum(salary + COALESCE(bonus, 0)) FROM table_employees =

Задание 1.

Есть 2 таблицы A и B, в таблице A - 3 строки, а в таблице B - 5 строк.
Таблицей слева всегда будет A, таблицей справа - B.
В каждой из них только одна колонка - id. Значения в этой колонке могут быть любые (одинаковые, разные),  но не null.

Напишите минимальное и максимальное количество строк, которое можем получить в результате известных нам соединений.

Задание 2.

 Напишите запрос, который выведет сотрудников, у которых зарплата больше, чем у их менеджеров в таблице employee_salary

In [ ]:
 id_employee	salary	id_manager
10	        155000	    11
11	        100000	    13
12	        95000	    13
13	        110000	    14
14	        150000	    null

Задание 3 Найдите разницу между зарплатой сотрудника и средней зарплатой его отдела.

In [ ]:
employee_salaries (Таблица зарплат)
employee_name    department    salary
Иван            IT           70000
Мария           IT           85000
Петр            IT           65000
Анна            Sales        60000
Сергей          Sales        75000
Ольга           Sales        62000

### Блок 2

In [1]:
#синтетический df
#запустить!

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('dark_background')
import seaborn as sns

n = 500  # количество записей
dates = pd.date_range(start='2023-01-01', periods=n, freq='D')
user_ids = np.random.randint(1, 100, n)
action_types = np.random.choice(['click', 'purchase', 'login'], n)
client_platforms = np.random.choice(['iOS', 'Android', 'Web'], n)

# Создание DataFrame
data = {
    'time': dates,
    'user_id': user_ids,
    'action_type': action_types,
    'client_platform': client_platforms
}
df = pd.DataFrame(data)

# Вывод первых 5 строк данных
df.head()

        time  user_id action_type client_platform
0 2023-01-01       92       login         Android
1 2023-01-02       21    purchase             iOS
2 2023-01-03       35    purchase         Android
3 2023-01-04       59       login         Android
4 2023-01-05       10       click         Android

1. Найдите среднее количество действий на одного пользователя.

2. Подсчитайте, сколько пользователей использовали более одной платформы.

3. Необходио визуализировать временной ряд, который отражает кол-во уникальных пользоватлей по каждому событию за каждый месяц, вне зависимости от платформы